In [3]:
import numpy as np;
import pandas as pd;

In [8]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston'],
    'Salary': [50000, 60000, 75000, 90000]
}

df = pd.DataFrame(data);
print(df)

      Name  Age         City  Salary
0    Alice   25     New York   50000
1      Bob   30  Los Angeles   60000
2  Charlie   35      Chicago   75000
3    David   40      Houston   90000

In [16]:
data_list = [
    ['Alice', 25, 'New York', 50000],
    ['Bob', 30, 'Los Angeles', 60000],
    ['Charlie', 35, 'Chicago', 75000],
    ['David', 40, 'Houston', 90000]
]

df2 = pd.DataFrame(data_list);

columns = ["name","age","city","salary"];


df2 = pd.DataFrame(data_list,columns=columns);

print(df2);

      name  age         city  salary
0    Alice   25     New York   50000
1      Bob   30  Los Angeles   60000
2  Charlie   35      Chicago   75000
3    David   40      Houston   90000

In [23]:
All_Name = df2['name'];
All_Age = df2[df2['age'] > 30];
All_city = df2['city'];
print(All_Name);
print(All_Age);
print(All_city);

0      Alice
1        Bob
2    Charlie
3      David
Name: name, dtype: object
      name  age     city  salary
2  Charlie   35  Chicago   75000
3    David   40  Houston   90000
0       New York
1    Los Angeles
2        Chicago
3        Houston
Name: city, dtype: object

In [31]:
two_column = df2[(df2["age"] > 30) | (df2["city"] == "New York")][["name","city","age"]];
print(two_column);

      name      city  age
0    Alice  New York   25
2  Charlie   Chicago   35
3    David   Houston   40

#### creating column

In [48]:
df2["designation"] = ["doctor","eng","doc","eng"];


df2[["name","city","age","designation"]];

print(df2);

df2.drop("designation",axis=1,inplace=True); # ye aab original se designation ko delete ker degaa

print(df2)

      name  age         city  salary designation
0    Alice   25     New York   50000      doctor
1      Bob   30  Los Angeles   60000         eng
2  Charlie   35      Chicago   75000         doc
3    David   40      Houston   90000         eng
      name  age         city  salary
0    Alice   25     New York   50000
1      Bob   30  Los Angeles   60000
2  Charlie   35      Chicago   75000
3    David   40      Houston   90000

### if i have to access the row then i can use df2.loc[0]

In [52]:
first_row = df2.loc[[0,1]];

print(first_row);

    name  age         city  salary
0  Alice   25     New York   50000
1    Bob   30  Los Angeles   60000

### select subset

In [61]:
subset = df2.loc[[0,1]][["city","salary"]];
print(subset);

          city  salary
0     New York   50000
1  Los Angeles   60000